data/F63-Request.xml

<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:sap-com:document:sap:rfc:functions"><soapenv:Header /><soapenv:Body><urn:RFC_CALL_TRANSACTION_USING><MODE>S</MODE><TCODE>F-63</TCODE><BT_DATA><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0100</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BLDAT</FNAM><FVAL>30102019</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BLART</FNAM><FVAL>KR</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BUKRS</FNAM><FVAL>1400</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BUDAT</FNAM><FVAL>30102019</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-MONAT</FNAM><FVAL>10</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-WAERS</FNAM><FVAL>EUR</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-XBLNR</FNAM><FVAL>TEST_PS_20190923</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>31</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>5001740</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-BKTXT</FNAM><FVAL>TEST</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-ZLSCH</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-GSBER</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-ZUONR</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>121</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BKPF-XMWST</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM>BSEG-ZTERM</FNAM><FVAL>Z060</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-ZFBDT</FNAM><FVAL>23092019</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-SGTXT</FNAM><FVAL>TEST</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0332</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-BVTYP</FNAM><FVAL></FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBS</FNAM><FVAL>40</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWKO</FNAM><FVAL>1530000</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBW</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>RF05V-NEWBK</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/00</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-WRBTR</FNAM><FVAL>100</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-MWSKZ</FNAM><FVAL>C2</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-SGTXT</FNAM><FVAL>just some comment</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-MENGE</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-MEINS</FNAM><FVAL>EA</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ZK</FVAL></item><item><PROGRAM>SAPLKACB</PROGRAM><DYNPRO>0002</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=ENTE</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>COBL-AUFNR</FNAM><FVAL>30000848</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>COBL-PS_POSID</FNAM><FVAL>14012001000000</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>COBL-PRCTR</FNAM><FVAL>102110</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>330</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM>DKACB-FMORE</FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0302</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=STER</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=DELZ</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>BSET-FWSTE(01)</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-FWSTE(01)</FNAM><FVAL>21</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSET-MWSKZ(01)</FNAM><FVAL>C2</FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BSEG-BSCHL(01)</FNAM><FVAL>40</FVAL></item><item><PROGRAM>SAPLTAX1</PROGRAM><DYNPRO>0300</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=GO</FVAL></item><item><PROGRAM>SAPMF05A</PROGRAM><DYNPRO>0320</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=AB</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=BP</FVAL></item><item><PROGRAM>SAPLF040</PROGRAM><DYNPRO>0700</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>/EEND</FVAL></item><item><PROGRAM>SAPLSPO1</PROGRAM><DYNPRO>0200</DYNPRO><DYNBEGIN>X</DYNBEGIN><FNAM></FNAM><FVAL></FVAL></item><item><PROGRAM></PROGRAM><DYNPRO>0000</DYNPRO><DYNBEGIN></DYNBEGIN><FNAM>BDC_OKCODE</FNAM><FVAL>=Yes</FVAL></item></BT_DATA><L_ERRORS><!--Zero or more repetitions:--><item><!--Optional:--><TCODE /><!--Optional:--><DYNAME /><!--Optional:--><DYNUMB /><!--Optional:--><MSGTYP /><!--Optional:--><MSGSPRA /><!--Optional:--><MSGID /><!--Optional:--><MSGNR /><!--Optional:--><MSGV1 /><!--Optional:--><MSGV2 /><!--Optional:--><MSGV3 /><!--Optional:--><MSGV4 /><!--Optional:--><ENV /><!--Optional:--><FLDNAME /></item></L_ERRORS></urn:RFC_CALL_TRANSACTION_USING></soapenv:Body></soapenv:Envelope>
